JayHeng/RT-MFB/boards/mimxrt/mfb_fw/src/mfb.c
#if MXIC_DEVICE_SERIES
            // MXIC
            case MXIC_DEVICE_VENDOR_ID:
                {
                    mfb_printf(" -- MXIC Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", jedecID.memoryTypeID);
                    switch (jedecID.memoryTypeID)
                    {
                        /////////////////////////QuadSPI////////////////////////
                        case 0x20:
                            mfb_printf(" -- MX25L/MX66L/MX25V QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x25:
                            mfb_printf(" -- MX25U/MX66U QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x28:
                            mfb_printf(" -- MX25R QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x75:
                            mfb_printf(" -- MX77L QuadSPI 3.3V Series.\r\n");
                            break;
                        ////////////////////////OctalSPI////////////////////////
                        case 0x80:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MX25UM/MX66UM OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x81:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MX25UM51345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x83:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MX25UM25345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x84:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MX25UW51345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x85:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MX25LM/MX66LM OctalSPI 3.3V Series.\r\n");
                            break;
                        // Missing MX25LW51245G, MX66LW1G45G, MX66LW2G45G
                        // Missing MX25UW6445G, MX66UW12845G, MX25UW25645G, MX25UW51245G, MX66UW1G45G, MX66UW2G45G
                        // Missing MX25UW6345G, MX66LW12345G, MX66UW25345G      done                 , MX66UW2G345G
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(jedecID.capacityID, false);
#if MXIC_DEVICE_QUAD
                    if (!sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_4PAD;
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_80MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
                        s_flashPropertyInfo.flashBusyStatusPol    = MXIC_FLASH_BUSY_STATUS_POL;
                        s_flashPropertyInfo.flashBusyStatusOffset = MXIC_FLASH_BUSY_STATUS_OFFSET;
                        s_flashPropertyInfo.flashQuadEnableCfg    = MXIC_FLASH_QUAD_ENABLE;
                        s_flashPropertyInfo.flashQuadEnableBytes  = 1;
                        cfg_customLUTVendor     = s_customLUT_MXIC_Quad;
                    }
#endif
#if MXIC_DEVICE_OCTAL
                    if (sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_8PAD;
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_166MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkExternalInputFromDqsPad;
                        s_flashPropertyInfo.flashBusyStatusPol    = MXIC_FLASH_BUSY_STATUS_POL;
                        s_flashPropertyInfo.flashBusyStatusOffset = MXIC_FLASH_BUSY_STATUS_OFFSET;
                        s_flashPropertyInfo.flashEnableOctalCmd   = MXIC_OCTAL_FLASH_ENABLE_DDR_CMD;
                        cfg_customLUTVendor     = s_customLUT_MXIC_Octal;
                        if (cfg_rootClkFreq == kFlexspiRootClkFreq_200MHz)
                        {
                            cfg_dummyValue = MXIC_OCTAL_FLASH_SET_DUMMY_CMD;
                        }
                    }
#endif
                    break;
                }
#endif // MXIC_DEVICE_SERIES

#if GIGADEVICE_DEVICE_SERIE
            // GigaDevice
            case GIGADEVICE_DEVICE_VENDOR_ID:
                {
                    mfb_printf(" -- GigaDevice Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", jedecID.memoryTypeID);
                    switch (jedecID.memoryTypeID)
                    {
                        /////////////////////////QuadSPI////////////////////////
                        case 0x40:
                            // GD25D DualSPI
                            mfb_printf(" -- GD25Q/GD25B/GD25S QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x42:
                            mfb_printf(" -- GD25VQ/GD25VE QuadSPI 2.5V Series.\r\n");
                            break;
                        case 0x47:
                            mfb_printf(" -- GD55B QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x60:
                            // GD25LD DualSPI
                            mfb_printf(" -- GD25LE/GD25LQ QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x63:
                            mfb_printf(" -- GD25LF/GD55LF QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x65:
                            // GD25WD DualSPI
                            mfb_printf(" -- GD25W/GD55W QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x66:
                            mfb_printf(" -- GD25LT/GD55LT QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x67:
                            mfb_printf(" -- GD25LB/GD55LB QuadSPI 1.8V Series.\r\n");
                            break;
                        ////////////////////////OctalSPI////////////////////////
                        case 0x68:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- GD25LX/GD55LX OctalSPI 1.8V Series.\r\n");
                            break;
                        // Missing GD25F, GD25LR, GD25T, GD25R
                        // Missing GD25X,
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(jedecID.capacityID, false);
#if GIGADEVICE_DEVICE_Quad
                    if (!sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_4PAD;
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_120MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
                        s_flashPropertyInfo.flashBusyStatusPol    = GIGADEVICE_FLASH_BUSY_STATUS_POL;
                        s_flashPropertyInfo.flashBusyStatusOffset = GIGADEVICE_FLASH_BUSY_STATUS_OFFSET;
                        s_flashPropertyInfo.flashQuadEnableCfg    = GIGADEVICE_FLASH_QUAD_ENABLE;
                        s_flashPropertyInfo.flashQuadEnableBytes  = 2;
                        cfg_customLUTVendor     = s_customLUT_GIGADEVICE_Quad;
                    }
#endif
#if GIGADEVICE_DEVICE_OCTAL
                    if (sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_8PAD;
                        s_flashPropertyInfo.flashBusyStatusPol    = GIGADEVICE_FLASH_BUSY_STATUS_POL;
                        s_flashPropertyInfo.flashBusyStatusOffset = GIGADEVICE_FLASH_BUSY_STATUS_OFFSET;
                        s_flashPropertyInfo.flashEnableOctalCmd   = GIGADEVICE_OCTAL_FLASH_ENABLE_DDR_CMD;
                        cfg_customLUTVendor     = s_customLUT_GIGADEVICE_Octal;
#if MFB_FLASH_FORCE_LOOPBACK_DQS
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_30MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
#else
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_166MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkExternalInputFromDqsPad;
                        if (cfg_rootClkFreq == kFlexspiRootClkFreq_200MHz)
#endif
                        {
                            cfg_dummyValue = GIGADEVICE_OCTAL_FLASH_SET_DUMMY_CMD;
                        }
                    }
#endif
                    break;
                }
#endif // GIGADEVICE_DEVICE_SERIE

