JayHeng/RT-MFB/boards/mimxrt/mfb_fw/src/mfb.c
#if ISSI_DEVICE_SERIES
            // ISSI
            case ISSI_DEVICE_VENDOR_ID:
                {
                    mfb_printf(" -- ISSI Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", jedecID.memoryTypeID);
                    switch (jedecID.memoryTypeID)
                    {
                        /////////////////////////QuadSPI////////////////////////
                        case 0x40:
                            mfb_printf(" -- IS25LQ/IS25LP QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x60:
                            mfb_printf(" -- IS25LP/IS25LE QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x70:
                            mfb_printf(" -- IS25WP/IS25WJ/IS25WE QuadSPI 1.8V Series.\r\n");
                            break;
                        ////////////////////////OctalSPI////////////////////////
                        case 0x5A:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- IS25LX OctalSPI 3.3V Series.\r\n");
                            break;
                        case 0x5B:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- IS25WX OctalSPI 1.8V Series.\r\n");
                            break;
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(jedecID.capacityID, false);
#if ISSI_DEVICE_QUAD
                    if (!sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_4PAD;
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_80MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
                        s_flashPropertyInfo.flashBusyStatusPol    = ISSI_FLASH_BUSY_STATUS_POL;
                        s_flashPropertyInfo.flashBusyStatusOffset = ISSI_FLASH_BUSY_STATUS_OFFSET;
                        s_flashPropertyInfo.flashQuadEnableCfg    = ISSI_FLASH_QUAD_ENABLE;
                        s_flashPropertyInfo.flashQuadEnableBytes  = 1;
                        cfg_customLUTVendor     = s_customLUT_ISSI_Quad;
                    }
#endif
#if ISSI_DEVICE_OCTAL
                    if (sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_8PAD;
                        s_flashPropertyInfo.flashBusyStatusPol    = ISSI_FLASH_BUSY_STATUS_POL;
                        s_flashPropertyInfo.flashBusyStatusOffset = ISSI_FLASH_BUSY_STATUS_OFFSET;
                        s_flashPropertyInfo.flashEnableOctalCmd   = ISSI_OCTAL_FLASH_ENABLE_DDR_CMD;
                        cfg_customLUTVendor     = s_customLUT_ISSI_Octal;
#if MFB_FLASH_FORCE_LOOPBACK_DQS
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_30MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
#else
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_166MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkExternalInputFromDqsPad;
                        if (cfg_rootClkFreq == kFlexspiRootClkFreq_200MHz)
#endif
                        {
                            cfg_dummyValue = ISSI_OCTAL_FLASH_SET_DUMMY_CMD;
                        }
                    }
#endif
                    break;
                }
#endif // ISSI_DEVICE_SERIES

#if MICRON_DEVICE_SERIES
            // Micron
            case MICRON_DEVICE_VENDOR_ID:
            case MICRON_DEVICE_VENDOR_ID2:
                {
                    mfb_printf(" -- Micron Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", jedecID.memoryTypeID);
                    switch (jedecID.memoryTypeID)
                    {
                        /////////////////////////QuadSPI////////////////////////
                        case 0xBA:
                            mfb_printf(" -- MT25QL QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0xBB:
                            mfb_printf(" -- MT25QU QuadSPI 1.8V Series.\r\n");
                            break;
                        ////////////////////////OctalSPI////////////////////////
                        case 0x5A:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MT35XL OctalSPI 3.3V Series.\r\n");
                            break;
                        case 0x5B:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MT35XU OctalSPI 1.8V Series.\r\n");
                            break;
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(jedecID.capacityID, false);
#if MICRON_DEVICE_QUAD
                    if (!sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_4PAD;
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_120MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
                        s_flashPropertyInfo.flashBusyStatusPol    = MICRON_FLASH_BUSY_STATUS_POL;
                        s_flashPropertyInfo.flashBusyStatusOffset = MICRON_FLASH_BUSY_STATUS_OFFSET;
                        //s_flashPropertyInfo.flashQuadEnableCfg    = MICRON_FLASH_QUAD_ENABLE;
                        cfg_customLUTVendor     = s_customLUT_MICRON_Quad;
                        /* No need to enable quad mode for micron device. */
                    }
#endif
#if MICRON_DEVICE_OCTAL
                    if (sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_8PAD;
                        s_flashPropertyInfo.flashBusyStatusPol    = MICRON_FLASH_BUSY_STATUS_POL;
                        s_flashPropertyInfo.flashBusyStatusOffset = MICRON_FLASH_BUSY_STATUS_OFFSET;
                        s_flashPropertyInfo.flashEnableOctalCmd   = MICRON_OCTAL_FLASH_ENABLE_DDR_CMD;
                        cfg_customLUTVendor     = s_customLUT_MICRON_Octal;
#if MFB_FLASH_FORCE_LOOPBACK_DQS
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_30MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
#else
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_166MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkExternalInputFromDqsPad;
                        if (cfg_rootClkFreq == kFlexspiRootClkFreq_200MHz)
#endif
                        {
                            cfg_dummyValue = MICRON_OCTAL_FLASH_SET_DUMMY_CMD;
                        }
                    }
#endif
                    break;
                }
#endif // MICRON_DEVICE_SERIES

#if ADESTO_DEVICE_SERIE
            // Adesto
            case ADESTO_DEVICE_VENDOR_ID:
            case ADESTO_DEVICE_VENDOR_ID2:
                {
                    mfb_printf(" -- Adesto Serial Flash.\r\n");
                    if (jedecID.memoryTypeID != 0x42)
                    {
                        jedecID.capacityID = jedecID.memoryTypeID & 0x1F;
                        jedecID.memoryTypeID = (jedecID.memoryTypeID & 0xE0) >> 5;
                        mfb_printf("MFB: Flash Family Code: 0x%x", jedecID.memoryTypeID);
                    }
                    else
                    {
                        mfb_printf("MFB: Flash Memory Type ID: 0x%x", jedecID.memoryTypeID);
                    }
                    switch (jedecID.memoryTypeID)
                    {
                        /////////////////////////QuadSPI////////////////////////
                        case 0x00:
                            mfb_printf(" -- AT25EU QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x01:
                            mfb_printf(" -- AT25DQ QuadSPI 2.5V Series.\r\n");
                            break;
                        case 0x02:
                            mfb_printf(" -- AT25FF/AT25XE/AT25XV QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x04:
                            mfb_printf(" -- AT25SF/AT25QF QuadSPI 3.3V Series.\r\n");
                            break;
                        // Only this type is same as other vendors
                        case 0x42:
                            mfb_printf(" -- AT25SL/AT25QL QuadSPI 1.8V Series.\r\n");
                            break;
                        ////////////////////////OctalSPI////////////////////////
                        case 0x05:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- ATXP OctalSPI 1.8V Series.\r\n");
                            break;
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    if (jedecID.memoryTypeID != 0x42)
                    {
                        mfb_show_mem_size(jedecID.capacityID, true);
                        cfg_flashMemSizeInByte = mfb_decode_adesto_capacity_id(jedecID.capacityID);
                    }
                    else
                    {
                        mfb_show_mem_size(jedecID.capacityID, false);
                        cfg_flashMemSizeInByte = mfb_decode_common_capacity_id(jedecID.capacityID);
                    }
#if ADESTO_DEVICE_QUAD
                    if (!sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_4PAD;
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_133MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
                        s_flashPropertyInfo.flashBusyStatusPol    = ADESTO_FLASH_BUSY_STATUS_POL;
                        s_flashPropertyInfo.flashBusyStatusOffset = ADESTO_FLASH_BUSY_STATUS_OFFSET;
                        s_flashPropertyInfo.flashQuadEnableCfg    = ADESTO_FLASH_QUAD_ENABLE;
                        s_flashPropertyInfo.flashQuadEnableBytes  = 1;
                        cfg_customLUTVendor     = s_customLUT_ADESTO_Quad;
                    }
#endif
                    break;
                }
#endif // ADESTO_DEVICE_SERIE

            default:
                mfb_printf("\r\nMFB: Unsupported Manufacturer ID\r\n");
                sta_isValidVendorId = false;
                break;
        }
        if (sta_isValidVendorId)
        {
            /* Configure FlexSPI pinmux as user prescriptive */
            flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, cfg_pad);
            /* Update root clock */
            //s_deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
            s_deviceconfig.flashSize = cfg_flashMemSizeInByte / 0x400;
            /* Re-init FlexSPI using custom LUT */
            flexspi_nor_flash_init(EXAMPLE_FLEXSPI, cfg_customLUTVendor, cfg_readSampleClock);
            mfb_printf("\r\nMFB: FLEXSPI module is initialized to multi-I/O fast read mode.\r\n");
            /* Write dummy cycle value into flash if needed */
            if (cfg_dummyValue != DUMMY_VALUE_INVALID)
            {
                flexspi_nor_set_dummy_cycle(EXAMPLE_FLEXSPI, (uint8_t)(cfg_dummyValue & 0xFF));
                mfb_printf("MFB: Flash dummy cycle is set to %d.\r\n", cfg_dummyValue);
            }
            if (!sta_isOctalFlash)
            {
                /* Enable quad mode. */
                status = flexspi_nor_enable_quad_mode(EXAMPLE_FLEXSPI);
                if (status != kStatus_Success)
                {
                    mfb_printf("MFB: Flash failed to Enter Quad I/O SDR mode.\r\n");
                }
                else
                {
                    mfb_printf("MFB: Flash entered Quad I/O SDR mode.\r\n");
                }
            }
            else
            {
                /* Enter octal DDR mode. */
#if !MFB_FLASH_FORCE_LOOPBACK_DQS
                status = flexspi_nor_enable_octal_mode(EXAMPLE_FLEXSPI);
                sta_isOctalDdrMode = true;
#endif
                if (status != kStatus_Success)
                {
                    mfb_printf("MFB: Flash failed to Enter Octal I/O DDR mode.\r\n");
                }
                else
                {
                    if (sta_isOctalDdrMode)
                    {
                        mfb_printf("MFB: Flash entered Octal I/O DDR mode.\r\n");
                    }
                    else
                    {
                        mfb_printf("MFB: Flash ran in Octal I/O SPI mode.\r\n");
                    }
                }
            }
            if (status == kStatus_Success)
            {
                mfb_show_flash_registers();
                bool isFirstTry = true;
                while (1)
                {
                    if (!mfb_flash_pattern_verify_test(!isFirstTry))
                    {
                         if (isFirstTry)
                         {
                             if (!mfb_flash_write_pattern_region(sta_isOctalDdrMode))
                             {
                                 return;
                             }
                         }
                         else
                         {
                             return;
                         }
                    }
                    if (isFirstTry)
                    {
                        /* Configure FlexSPI clock as user prescriptive */ 
                        flexspi_clock_init(EXAMPLE_FLEXSPI, cfg_rootClkFreq);
                        /* Show FlexSPI clock source */
                        flexspi_show_clock_source(EXAMPLE_FLEXSPI);
                        isFirstTry = false;
                    }
                    else
                    {
                        break;
                    }
                }
                mfb_flash_memcpy_perf_test(false);
                mfb_jump_to_application(EXAMPLE_FLEXSPI_AMBA_BASE + MFB_APP_IMAGE_OFFSET);
            }
        }
    }
}
